x = "Hello"
print(x)
print(type(x)) # проверка переменную на тип (класс)
x = 1 + 2 + 3 # переприсваивание переменной
a = 2
b = 5
tmp = a
a = b
b = tmp # tmp временная 1 переменную
a = 2
b = 2 
temp1 = a
temp2 = b
x = y = z = 0 # все три переменные присвоенны нулю (каскадное присваивание)
x, y, z = 1, 2, 3 # множественное присваивание (кортеж - это пачка т. е. пачка переменных)
a, b = b, a # простой способ обмена двух переменных без временных переменных
k = 3 ** 0.5 # это перевод в корень числа 3
